KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтчетОбОтгрузкахПоГособоронзаказам/КАНАТ_ОтчетОбОтгрузкахПоГособоронзаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ОтчетОбОтгрузкахПоГособоронзаказам</name>
  <comment>№000000100 ЧТЗ 2.13 Отчеты ГОЗ</comment>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/ЖурналУчетаСчетовФактур/ЖурналУчетаСчетовФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e3cd2832-710c-4455-b0f1-1225ae1fc53d">
  <name>ЖурналУчетаСчетовФактур</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="133cf3c5-93e5-45ed-a5c8-59b2d3fd085f">
    <name>СуммаПоСчетуФактуре</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="291eb09f-d631-45b6-9ac3-31304a170c5d">
    <name>СчетФактура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/Enums/ТипыНаправленийДеятельности/ТипыНаправленийДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c48660c5-edbd-4c32-8897-06db07cbe865">
  <name>ТипыНаправленийДеятельности</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c187a341-c4b3-44aa-aab0-1360e9444df6">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="58686353-1d16-4f22-bcab-35265a7b5744">
    <name>КонтрактГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/СчетФактураВыданный/СчетФактураВыданный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9eab2298-ca44-4cc2-a529-95431e0e3800">
  <name>СчетФактураВыданный</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="861dd4a6-11fe-4e8a-94aa-230cc1037aa1">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5ebb45d-36cc-4d4e-aaae-5effa624ce42">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd65fde8-b84e-417c-a0f6-6d991416b565">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a96d4ac2-d10a-4fee-87a1-589480786aff">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8a622e4b-561c-49a4-97dd-da5615b0c95f">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="50371f97-7440-48ec-8481-2c7e9c812287">
    <name>ПлатежноРасчетныеДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="043d3fd2-2de7-4440-9727-ac6351b61a5e">
      <name>НомерПлатежноРасчетногоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7b0e9642-7b63-4ca0-b12e-34bdd79511b9">
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3404cb9a-92ea-42b9-9086-ad481dbc27d7">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ХранилищеИтоговыйТекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПоСоглашению</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d4de0c91-22dd-4ce4-bc98-884061653165">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b99d944-1b87-423e-a8a0-f6748f86530b">
    <name>НаименованиеДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e0158-d692-474d-bb59-3cb9fe0131ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec175e6e-8a0f-46c1-8f61-1933ed068350">
    <name>ДоговорСУчастникомГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2821c1b-dcf2-47d6-9871-b26fe7c33e1f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a00d91d9-5c1d-491a-b338-92dc631c1afd">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ba089968-9caa-4200-9002-b8f3267b4b61">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fe24eab-4e23-451e-8cae-c25d6e78e3df">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КАНАТ_БлокиДоговора</name>
    <attributes>
      <name>БлокДоговора</name>
      <type>
        <types>CatalogRef.КАНАТ_БлокиДоговоров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ГосударственныеКонтракты/ГосударственныеКонтракты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="150b7e79-b2ba-4802-8c98-0fb39df77a4a">
  <name>ГосударственныеКонтракты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="44f46d80-32d9-47d2-94e4-81c4f7139f4a">
    <name>НомерИГК</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb40c87b-9005-456d-b42f-f3b6a887cee5">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2cddc38e-54ee-405d-ab65-b99a6675c8d5">
    <name>ПредметКонтракта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06d38dba-215d-40b4-8d80-1a415a672df8">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4a3012a7-a307-43fa-99df-9112aa5d6559">
    <name>ДатаЗаключения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45ba24f8-10ba-476f-9192-af80cb30a623">
    <name>ВнутреннийИдентификаторЕИС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8cdf14cd-5534-4834-8b09-97d008f577ef">
    <name>ТипНаправленияДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтчетОбОтгрузкахПоГособоронзаказам/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьДоступностьЭлементов();
	
КонецПроцедуры


&НаСервере
Процедура ИзменитьДоступностьЭлементов()
	
	Если ИспользоватьГосконтракт Тогда
		Элементы.Госконтракт.Доступность = Истина;
	Иначе
		Госконтракт = Перечисления.ТипыНаправленийДеятельности.ПустаяСсылка();
		Элементы.Госконтракт.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПлательщик Тогда
		Элементы.Плательщик.Доступность = Истина;
	Иначе
		Плательщик = Справочники.Контрагенты.ПустаяСсылка();
		Элементы.Плательщик.Доступность = Ложь;
	КонецЕсли;
	
	Если ИспользоватьПериод Тогда
		Элементы.Период.Доступность = Истина;
	Иначе
		Период.ДатаНачала= Дата("00010101");
		Период.ДатаОкончания = ТекущаяДата();
		Элементы.Период.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПлательщикПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГосконтрактПриИзменении(Элемент)
	ИзменитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабличныйДокумент = СформироватьТабличныйДокумент();
	
	Идентификатор = "ОтчетГособоронзаказПериод";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о реализации по гособоронзаказам за период";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры 

&НаСервере
Функция СформироватьТабличныйДокумент()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ОтчетОбОтгрузкахПоГособоронзаказам.КАНАТ_ПФ_РеализацияГособоронЗаказ");
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Организация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	ДанныеШапки.Вставить("НачалоПериода", Формат(Период.ДатаНачала,"ДФ=dd.MM.yy"));
	ДанныеШапки.Вставить("КонецПериода", Формат(Период.ДатаОкончания,"ДФ=dd.MM.yy"));
	
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	
	//Таблица
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.Контрагент КАК Плательщик,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Сумма, 0) КАК СуммаКонтракта,
	|	ГосударственныеКонтракты.Представление КАК Представление,
	|	ГосударственныеКонтракты.НомерИГК КАК НомерИГК,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре КАК СуммаПоСчетуФактуре,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Номер, """") КАК НомерРеализации,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРеализации,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.СуммаДокумента, 0) КАК СуммаРеализации
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГосударственныеКонтракты КАК ГосударственныеКонтракты
	|			ПО ДоговорыКонтрагентов.ГосударственныйКонтракт = ГосударственныеКонтракты.Ссылка
	|		ПО СчетФактураВыданный.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних КАК ЖурналУчетаСчетовФактурСрезПоследних
	|		ПО СчетФактураВыданный.Ссылка = ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|ГДЕ
	|	(СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ НЕ &ИспользоватьПериод)
	|	И (СчетФактураВыданный.Контрагент = &Плательщик
	|			ИЛИ НЕ &ИспользоватьПлательщик)
	|	И (ГосударственныеКонтракты.Ссылка = &Госконтракт
	|			ИЛИ НЕ &ИспользоватьГосконтракт)
	|	И ДоговорыКонтрагентов.ДоговорСУчастникомГОЗ
	|	И СчетФактураВыданный.Проведен = ИСТИНА
	|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ГосударственныеКонтракты.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданный.Номер,
	|	СчетФактураВыданный.Дата,
	|	СчетФактураВыданный.Контрагент,
	|	ДоговорыКонтрагентов.Сумма,
	|	ГосударственныеКонтракты.Представление,
	|	ГосударственныеКонтракты.НомерИГК,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Номер, """"),
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Дата, ДАТАВРЕМЯ(1, 1, 1)),
	|	ЕСТЬNULL(РеализацияТоваровУслуг.СуммаДокумента, 0)";
	
	Запрос.УстановитьПараметр("Госконтракт"				,Госконтракт);
	Запрос.УстановитьПараметр("ИспользоватьГосконтракт"	,ИспользоватьГосконтракт);
	Запрос.УстановитьПараметр("ИспользоватьПериод"		,ИспользоватьПериод);
	Запрос.УстановитьПараметр("ИспользоватьПлательщик"	,ИспользоватьПлательщик);
	Запрос.УстановитьПараметр("КонецПериода"			,Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода"			,Период.ДатаНачала);
	Запрос.УстановитьПараметр("Плательщик"				,Плательщик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИтогоСуммаДоговор		= 0;
	ИтогоСуммаСФ			= 0;
	ИтогоСуммаРеализации	= 0;
	Счетчик = 1;
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьТаблица");
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("ПП",             Счетчик);
		ДанныеСтроки.Вставить("Номер",          Выборка.Номер);
		ДанныеСтроки.Вставить("Дата",           Выборка.Дата);
		ДанныеСтроки.Вставить("Плательщик",     Выборка.Плательщик);
		ДанныеСтроки.Вставить("СуммаКонтракта", Выборка.СуммаКонтракта);
		ДанныеСтроки.Вставить("СуммаСФ",        Выборка.СуммаПоСчетуФактуре);
		ДанныеСтроки.Вставить("Госконтракт",    Выборка.Представление);
		ДанныеСтроки.Вставить("ИГК",            Выборка.НомерИГК);
		ДанныеСтроки.Вставить("НомерРеализации",Выборка.НомерРеализации);
		ДанныеСтроки.Вставить("ДатаРеализации", Формат(Выборка.ДатаРеализации,"ДФ=dd.MM.yyyy"));
		ДанныеСтроки.Вставить("СуммаРеализации",Выборка.СуммаРеализации);
		
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеСтроки);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
		Счетчик					= Счетчик + 1;
		ИтогоСуммаДоговор		= ИтогоСуммаДоговор + Выборка.СуммаКонтракта;
		ИтогоСуммаСФ			= ИтогоСуммаСФ + Выборка.СуммаПоСчетуФактуре;
		ИтогоСуммаРеализации	= ИтогоСуммаРеализации+ Выборка.СуммаРеализации;
	КонецЦикла;
	
	ОбластьТаблицаПодвал = Макет.ПолучитьОбласть("ОбластьТаблицаПодвал");
	ДанныеИтоги = Новый Структура;
	ДанныеИтоги.Вставить("ИтогоСуммаКонтракт"	,ИтогоСуммаДоговор);
	ДанныеИтоги.Вставить("ИтогоСуммаСФ"			,ИтогоСуммаСФ);
	ДанныеИтоги.Вставить("ИтогоСуммаРеализации"	,ИтогоСуммаРеализации);
	
	ОбластьТаблицаПодвал.Параметры.Заполнить(ДанныеИтоги);
	ТабличныйДокумент.Вывести(ОбластьТаблицаПодвал);
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ДанныеПодвал = Новый Структура;
	ДанныеПодвал.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	ДанныеПодвал.Вставить("Дата", ТекущаяДата());
	
	ОбластьПодвал.Параметры.Заполнить(ДанныеПодвал);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
